bool isGenerate = true;

Map getHashAnimalYear = {
	"01": "ជូត",
	"02": "ឆ្លូវ",
	"03": "ខាល",
	"04": "ថោះ",
	"05": "រោង",
	"06": "ម្សាញ់",
	"07": "មមី",
	"08": "មមែ",
	"09": "វក",
	"10": "រកា",
	"11": "ច",
	"12": "កុរ"
};

Map getHashMonth = {
	"01": "មិគសិរ",
	"02": "បុស្ស",
	"03": "មាឃ",
	"04": "ផល្គុន",
	"05": "ចេត្រ",
	"06": "ពិសាខ",
	"07": "ជេស្ឋ",
	"08": "អាសាធ",
	"09": "បឋមសាធ",
	"10": "ទុតិយសាធ",
	"11": "ស្រាពណ៌",
	"12": "ភទ្របទ",
	"13": "អស្សុជ",
	"14": "កក្ដិក",
};

Map getHashSak = {
	"01": "ឯក​ស័ក",
	"02": "ទោ​ស័ក",
	"03": "ត្រី​ស័ក",
	"04": "ចត្វា​ស័ក",
	"05": "បញ្ច​ស័ក",
	"06": "ឆ​ស័ក",
	"07": "សប្ត​ស័ក",
	"08": "អដ្ឋ​ស័ក",
	"09": "នព្វ​ស័ក",
	"10": "សំរឹទ្ធិ​ស័ក"
};

Map getWeekDayKH = {
	1: 'ចន្ទ័',
	2: 'អង្គារ',
	3: 'ពុធ',
	4: 'ព្រហ',
	5: 'សុក្រ',
	6: 'សៅរ៏',
	7: 'អាទិត្យ​​'
};

Map getWeekDayEN = {
	1: 'MON',
	2: 'TUE',
	3: 'WED',
	4: 'THU',
	5: 'FRI',
	6: 'SAT',
	7: 'SUN',
};

Map getMonthEn = {
	1: "January",
	2: "February",
	3: "March",
	4: "April",
	5: "May",
	6: "June",
	7: "July",
	8: "August",
	9: "September",
	10: "October",
	11: "November",
	12: "December",
};

Map getMonthKh = {
	1: "មករា",
	2: "កុម្ភៈ",
	3: "មីនា",
	4: "មេសា",
	5: "ឧសភា",
	6: "មិថុនា",
	7: "កក្តដា",
	8: "សីហា",
	9: "កញ្ញា",
	10: "តុលា",
	11: "វិច្ជិកា",
	12: "ធ្នូ",
};


